# Join

In [6]:
import pandas as pd

df1 = pd.DataFrame({"A":[1,2,3,4], "B":[5,9,8,7]})
df2 = pd.DataFrame({"C":[11,12,23,54], "D":[55,97,78,17]})

df1.join(df2)

   A  B   C   D
0  1  5  11  55
1  2  9  12  97
2  3  8  23  78
3  4  7  54  17

In [8]:
df1 = pd.DataFrame({"A":[1,2,3,4], "B":[5,9,8,7]})
df2 = pd.DataFrame({"C":[11,12], "D":[55,97]})

df1.join(df2)

   A  B     C     D
0  1  5  11.0  55.0
1  2  9  12.0  97.0
2  3  8   NaN   NaN
3  4  7   NaN   NaN

In [11]:
df1 = pd.DataFrame({"A":[1,2,3,4], "B":[5,9,8,7]},index=["a","b","c","d"])
df2 = pd.DataFrame({"C":[11,12], "D":[55,97]},index=["a","b"])

df1.join(df2)

   A  B     C     D
a  1  5  11.0  55.0
b  2  9  12.0  97.0
c  3  8   NaN   NaN
d  4  7   NaN   NaN

In [12]:
df1 = pd.DataFrame({"A":[1,2,3,4], "B":[5,9,8,7]},index=["a","b","c","d"])
df2 = pd.DataFrame({"C":[11,12], "D":[55,97]},index=["a","b"])

df1.join(df2,how="right")

   A  B   C   D
a  1  5  11  55
b  2  9  12  97

In [13]:
df1 = pd.DataFrame({"A":[1,2,3,4], "B":[5,9,8,7]},index=["a","b","c","d"])
df2 = pd.DataFrame({"C":[11,12], "D":[55,97]},index=["a","b"])

df1.join(df2,how="outer")

   A  B     C     D
a  1  5  11.0  55.0
b  2  9  12.0  97.0
c  3  8   NaN   NaN
d  4  7   NaN   NaN

In [14]:
df1 = pd.DataFrame({"A":[1,2,3,4], "B":[5,9,8,7]},index=["a","b","c","d"])
df2 = pd.DataFrame({"C":[11,12], "D":[55,97]},index=["a","b"])

df1.join(df2,how="left")

   A  B     C     D
a  1  5  11.0  55.0
b  2  9  12.0  97.0
c  3  8   NaN   NaN
d  4  7   NaN   NaN

In [15]:
df1 = pd.DataFrame({"A":[1,2,3,4], "B":[5,9,8,7]},index=["a","b","c","d"])
df2 = pd.DataFrame({"C":[11,12], "D":[55,97]},index=["a","b"])

df1.join(df2,how="inner")

   A  B   C   D
a  1  5  11  55
b  2  9  12  97

In [17]:
df1 = pd.DataFrame({"A":[1,2,3,4], "B":[5,9,8,7]},index=["a","b","c","d"])
df2 = pd.DataFrame({"C":[11,12], "B":[55,97]},index=["a","b"])

df1.join(df2,how="inner",lsuffix="12")

   A  B12   C   B
a  1    5  11  55
b  2    9  12  97

In [18]:
df1.join(df2,how="outer",lsuffix="12")

   A  B12     C     B
a  1    5  11.0  55.0
b  2    9  12.0  97.0
c  3    8   NaN   NaN
d  4    7   NaN   NaN

In [19]:
df1.join(df2,how="inner",lsuffix="12",rsuffix="122")

   A  B12   C  B122
a  1    5  11    55
b  2    9  12    97

# Append:

In [10]:
df1 = pd.DataFrame({"A":[1,2,3,4,5],"B":[6,7,8,9,6]})
df2 = pd.DataFrame({"C":[8,6,4], "B":[4,6,7]})
df1.append(df2)

AttributeError: 'DataFrame' object has no attribute 'append'